{
    "data": [
        {
            "id": "1-1",
            "category": 1,
            "text": "Написать программу нахождения большего из двух чисел. "
        },
        {
            "id": "1-2",
            "category": 1,
            "text": "Написать программу нахождения большего из 3 чисел. "
        },
        {
            "id": "1-3",
            "category": 1,
            "text": "Написать программу определяющую четность(нечетность) числа и выводящую результат на экран. "
        },
        {
            "id": "1-4",
            "category": 1,
            "text": "Из двух чисел с разной четностью вывести на экран нечетное число. "
        },
        {
            "id": "1-5",
            "category": 1,
            "text": "Среди трех чисел найти среднее. Если среди чисел есть равные, вывести сообщение \"Ошибка\"."
        },
        {
            "id": "1-6",
            "category": 1,
            "text": "Написать программу, которая вычисляет количество цифр в числе (не более 3). "
        },
        {
            "id": "1-7",
            "category": 1,
            "text": "Написать программу нахождения дискриминанта. "
        },
        {
            "id": "1-8",
            "category": 1,
            "text": "Вывести название дня недели по его номеру. "
        },
        {
            "id": "1-9",
            "category": 1,
            "text": "Даны два числа. Вывести вначале большее, а затем меньшее из них"
        },
        {
            "id": "1-10",
            "category": 1,
            "text": "Даны три целых числа. Найти количество положительных чисел в исходном наборе"
        },
        {
            "id": "2-1",
            "category": 2,
            "text": "Написать программу, которая выводит на экран все натуральные числа от 1 до 10"
        },
        {
            "id": "2-2",
            "category": 2,
            "text": "Написать программу, которая подсчитывает сумму натуральных чисел от 1 до n10"
        },
        {
            "id": "2-3",
            "category": 2,
            "text": "Написать программу, которая выводит на экран: 20 40 80 160 320"
        },
        {
            "id": "2-4",
            "category": 2,
            "text": "Написать программу, которая подсчитывает произведение натуральных чисел от 1 до 10 "
        },
        {
            "id": "2-5",
            "category": 2,
            "text": "Написать программу, выводящую на экран квадраты чисел от 1 до 10. "
        },
        {
            "id": "2-6",
            "category": 2,
            "text": "Написать программу, выводящую на экран таблицу Пифагора. "
        },
        {
            "id": "2-7",
            "category": 2,
            "text": "Написать программу находящую сумму цифр введенного числа. "
        },
        {
            "id": "2-8",
            "category": 2,
            "text": "Даны два целых числа A и B(A<B). С помощью цикла с параметром найти сумму все чисел от A до B. "
        },
        {
            "id": "3-1",
            "category": 3,
            "text": "Вычислить сумму элементов двух массивов с одинаковыми порядковыми номерами. "
        },
        {
            "id": "3-2",
            "category": 3,
            "text": "Отсортировать одномерный массив по возрастанию. "
        },
        {
            "id": "3-3",
            "category": 3,
            "text": "Дан массив А. Необходимо переписать в массив В все числа массива А кратные 3, а также вывести на экран эти элементы и их количество. "
        },
        {
            "id": "4-1",
            "category": 4,
            "text": "Создать массив с помощью ввода элементов массива с клавиатуры и посчитать сумму всех элементов массива. "
        },
        {
            "id": "4-2",
            "category": 4,
            "text": "Создать массив с помощью генератора случайных чисел и посчитать сумму всех чётных чисел. "
        },
        {
            "id": "4-3",
            "category": 4,
            "text": "Создать массив с помощью генератора случайных чисел и посчитать сумму всех нечетных элементов массива. "
        },
        {
            "id": "4-4",
            "category": 4,
            "text": "Создайте массив чисел. Найдите, сколько в нем пар одинаковых соседних элементов. "
        },
        {
            "id": "4-5",
            "category": 4,
            "text": "Дано 100 целых чисел. Распечатать их в обратном порядке по 6 чисел в строке. "
        },
        {
            "id": "4-6",
            "category": 4,
            "text": "Создать массив с помощью ГСЧ и найти максимальный элемент массив. "
        },
        {
            "id": "5-1",
            "category": 5,
            "text": "Создать двумерный массив размерностью 5х5, описать в разделе описания переменных, заполнить его числами с клавиатуры. "
        },
        {
            "id": "5-2",
            "category": 5,
            "text": "Создать двумерный массив размерностью 10х7, описать в разделе описания типов, заполнить его числами с помощью ГСЧ"
        },
        {
            "id": "5-3",
            "category": 5,
            "text": "Создать двумерный массив размерностью 10х7, описать как одномерный, элементами которого являются одномерные, заполнить его числами с помощью ГСЧ"
        },
        {
            "id": "5-4",
            "category": 5,
            "text": "Дано 2 массива. Создать 3 массив, чтобы элементы 3 массива были суммой элементов 1 и 2 массивов. "
        },
        {
            "id": "5-5",
            "category": 5,
            "text": "Дано 2 массива. Создать 3 массив, чтобы элементы 3 массива были произведением элементов 1 и 2 массивов, если итоговое число кратно 3, то заменить его на 0. "
        },
        {
            "id": "6-1",
            "category": 6,
            "text": "Создать двумерный массив размерностью не меньше 10х10 и вывести его на экран. Найти и вывести на экран элемент массива путем ввода с клавиатуры его координат (номера строки и номера столбца). "
        },
        {
            "id": "6-2",
            "category": 6,
            "text": "Создать двумерный массив размерностью не меньше 10х10 и вывести его на экран. Найти количество элементов больших 5 в каждой строке и вывести в отдельный одномерный массив. "
        },
        {
            "id": "6-3",
            "category": 6,
            "text": "Создать квадратный двумерный массив размерностью не меньше 4х4 и вывести его на экран. Создать ещё один двумерный массив, который будет заполняться элементами первого массива стоящими правее середины массива. (соответственно для массива 4х4, это будет массив 4х2)"
        },
        {
            "id": "6-4",
            "category": 6,
            "text": "Составить программу, заменяющую значение любого элемента двухмерного массива на число а. "
        },
        {
            "id": "6-5",
            "category": 6,
            "text": "Дан двумерный массив размерностью 10х10. Определить:<ol><li>сумму элементов главной диагонали массива</li><li>среднее арифметическое элементов главной диагонали.</li><li>среднее арифметическое элементов побочной диагонали</li></ol>"
        },
        {
            "id": "6-6",
            "category": 6,
            "text": "Составить программу, которая проводит замену всех элементов некоторого столбца двухмерного массива на заданное число. "
        },
        {
            "id": "6-7",
            "category": 6,
            "text": "Найти наименьший элемент двумерного массива. Размер n*m. Элементы задаются на интервале [-30, 45]. "
        },
        {
            "id": "6-8",
            "category": 6,
            "text": "Найти номер столбца массива размером n*m, в котором находится наибольшее количество отрицательных элементов"
        },
        {
            "id": "7-1",
            "category": 7,
            "text": "Создать одномерный массив размерностью 10. Отсортировать элементы массива по возрастанию «Пузырьковым методом». "
        },
        {
            "id": "7-2",
            "category": 7,
            "text": "Создать одномерный массив размерностью 10. Отсортировать первые 5 элементов по возрастанию, а оставшиеся по убыванию. "
        },
        {
            "id": "7-3",
            "category": 7,
            "text": "Создать двумерный массив. Отсортировать каждую строку массива по возрастанию. "
        },
        {
            "id": "8-1",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Сформировать новый массив, состоящий из противоположных соответствующих элементов (поменять знаки). "
        },
        {
            "id": "8-2",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Выяснить, какое первое число встречается в каждой строке — положительное или отрицательное. И вывести + или -. (Значения можно как просто выводить, так и добавлять в массив типа char)"
        },
        {
            "id": "8-3",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Выяснить, в какой строке последовательность является возрастающей или убывающей. "
        },
        {
            "id": "8-4",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Вывести его элементы, индексы которых являются степенями двойки (1, 2, 4, 8, 16, . . .). "
        },
        {
            "id": "8-5",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Вывести на экран элементы, которые являются квадратами какого-либо числа. "
        },
        {
            "id": "8-6",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Поменять местами первый и последний элементы. "
        },
        {
            "id": "8-7",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Заменить все элементы на их квадраты. "
        },
        {
            "id": "8-8",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Найти максимум и минимум. Поменять их местами. "
        },
        {
            "id": "8-9",
            "category": 8,
            "text": "Дан целочисленный двумерный массив, размерности n х n. Вычислить сумму чисел, порядковые номера которых являются числами Фибоначчи. "
        },
        {
            "id": "9-1",
            "category": 9,
            "text": "Отсортировать столбец двумерного массива по возрастанию. Номер столбца вводится с клавиатуры. "
        },
        {
            "id": "9-2",
            "category": 9,
            "text": "Отсортировать строки массива по возрастанию и вывести на экран. Так же вывести минимальное число в каждой строке. Отсортировать столбцы исходного массива по убыванию и вывести максимальные элементы столбцов. "
        },
        {
            "id": "10-1",
            "category": 10,
            "text": "Дан двухмерный массив чисел. Вычислить сумму элементов матрицы, индексы которых составляют в сумме заданное число K (это число вводится пользователем). Вывести результат. "
        },
        {
            "id": "10-2",
            "category": 10,
            "text": "Создать массив 6*6. Отсортировать числа побочной диагонали по возрастанию с 1 столбца до 3 и по убыванию с 4 столбца до 6. "
        },
        {
            "id": "10-3",
            "category": 10,
            "text": "Дан двумерный массив поменять местами числа главной и побочной диагоналей в строке. Вывести на экран измененный массив. Поменять местами в исходном массиве числа главной и побочной диагоналей в столбце. "
        },
        {
            "id": "10-4",
            "category": 10,
            "text": "Дан двумерный массив размерности не менее 5*5. Преобразовать исходный массив так, чтобы последний элемент каждой строки был заменен суммой предыдущих элементов той же строки. "
        },
        {
            "id": "10-5",
            "category": 10,
            "text": "Даны два одномерных массива с различным количеством элементов и натуральное число k (вводится с клавиатуры). Объединить их в один массив, включив второй массив между k-м и (k+1)-м элементами первого. (Решить, используя дополнительный массив)"
        },
        {
            "id": "10-6",
            "category": 10,
            "text": "Даны два одномерных массива с различным количеством элементов и натуральное число k (вводится с клавиатуры). Объединить их в один массив, включив второй массив между k-м и (k+1)-м элементами первого. (Решить без использования дополнительного массива)"
        },
        {
            "id": "11-1",
            "category": 11,
            "text": "Создать и вывести двумерный массив на экран с помощью процедуры"
        },
        {
            "id": "11-2",
            "category": 11,
            "text": "Создать два двумерных массива с использованием процедур и процедуру для их сложения. "
        },
        {
            "id": "11-3",
            "category": 11,
            "text": "Создать два двумерных массива с использованием процедур и процедуру для вычитания значений второго массива из первого. "
        },
        {
            "id": "11-4",
            "category": 11,
            "text": "Написать процедуру вычисления корней квадратного уравнения. "
        },
        {
            "id": "11-5",
            "category": 11,
            "text": "Сформировать массив из случайных целых чисел. Сообщить, есть ли в нем элемент, указанный пользователем. Перед поиском элементы массива отсортировать (при этом оставив исходный массив без изменений). В программе должны быть три процедуры - заполнение массива, сортировка, поиск элемента. "
        },
        {
            "id": "11-6",
            "category": 11,
            "text": "Дана квадратная матрица. Вычесть значения элементов последней строки из соответствующих элементов каждой строки. "
        },
        {
            "id": "12-1",
            "category": 12,
            "text": "Составить функцию находящую факториал числа. "
        },
        {
            "id": "12-2",
            "category": 12,
            "text": "Написать функцию, которая циклически сдвигает одномерный массив вправо или влево на указанное число позиций. Сдвиг также должен быть кольцевым, то есть те элементы, которые уходят вправо или влево за пределы массива, должны помещаться с другого его конца"
        },
        {
            "id": "13-1",
            "category": 13,
            "text": "Написать рекурсивную функцию нахождения факториала числа N. "
        },
        {
            "id": "13-2",
            "category": 13,
            "text": "Написать рекурсивную функцию перевода чисел из десятичной системы счисления в другие. "
        },
        {
            "id": "14-1",
            "category": 14,
            "text": "Определить кол-во слов в строке. Слова отделяются одним или несколькими пробелами. "
        },
        {
            "id": "14-2",
            "category": 14,
            "text": "Определить номера позиций и кол-во повторений запрашиваемого символа в строке, введённой с клавиатуры. "
        },
        {
            "id": "14-3",
            "category": 14,
            "text": "Найти и заменить определённый символ в строке, введённой с клавиатуры. Программа должна запрашивать заменяемый и заменяющий символы, а также подтверждение каждой замены символа с сообщением его номера в строке. "
        },
        {
            "id": "14-4",
            "category": 14,
            "text": "Определить самое короткое и самое длинное слово в строке, введённой с клавиатуры. "
        },
        {
            "id": "15-1",
            "category": 15,
            "text": "Создать файл input.txt содержащий в себе строку из чисел. Переписать все данные из файла input.txt в файл output.txt. "
        },
        {
            "id": "15-2",
            "category": 15,
            "text": "Создать файл input.txt содержащий в себе строку из чисел. Посчитать количество и сумму этих чисел, ответ записать следующей строкой файла input.txt. "
        },
        {
            "id": "15-3",
            "category": 15,
            "text": "Создать файл input.txt содержащий в себе строку из чисел и символов. Посчитать количество и сумму чисел, ответ записать следующей строкой файла input.txt. "
        }
    ],
    "categories": [
        {
            "id": 1,
            "icon": "crosshairs-question",
            "title": "Условный оператор"
        },
        {
            "id": 2,
            "icon": "repeat",
            "title": "Цикл"
        },
        {
            "id": 3,
            "icon": "code-array",
            "title": "Массивы"
        },
        {
            "id": 4,
            "icon": "code-array",
            "title": "Одномерные массивы"
        },
        {
            "id": 5,
            "icon": "iframe-array-outline",
            "title": "Создание и вывод двумерного массива"
        },
        {
            "id": 6,
            "icon": "iframe-array-outline",
            "title": "Обработка элементов двумерного массив"
        },
        {
            "id": 8,
            "icon": "iframe-array-outline",
            "title": "Работа с квадратными массивами"
        },
        {
            "id": 7,
            "icon": "sort-ascending",
            "title": "Сортировки"
        },
        {
            "id": 9,
            "icon": "sort-variant",
            "title": "Использование способов сортировки при работе с массивами"
        },
        {
            "id": 10,
            "icon": "sort-variant",
            "title": "Использование сортировки при решении задач. Работа с квадратными массивам"
        },
        {
            "id": 11,
            "icon": "function",
            "title": "Использование процедур при решении задач"
        },
        {
            "id": 12,
            "icon": "function",
            "title": "Использование функций при решении задач"
        },
        {
            "id": 13,
            "icon": "refresh",
            "title": "Использование рекурсии при решении задач"
        },
        {
            "id": 14,
            "icon": "format-text",
            "title": "Строки"
        },
        {
            "id": 15,
            "icon": "file",
            "title": "Работа с файлами"
        }
    ]
}
